
export interface GuideModalSchema {
  isModalOpen: boolean;
}

export const steps = [
  { title: '', myTitle: 'Добро пожаловать!', myImage: '/_defaults/guide/1.gif', myDescription: "Спасибо, что Вы выбрали нас! Мы подготовили небольшое обучение, из которого вы узнаете, как пользоваться <span class='c-accent'>Studlog</span>. Сделай учебу проще!" },
  { title: '', myTitle: 'Виджет расписания', myImage: '/_defaults/guide/2.gif', myDescription: "В блоке справа Вы можете увидеть виджет с расписанием — там находятся ваши пары. Пара которая <span class='c-accent'>идет сейчас</span> подсвечена синим цветом. <span class='c-attention'>Дистанционные пары</span> обозначены оранжевым цветом." },
  { title: '', myTitle: 'Открытая страница расписания', myImage: '/_defaults/guide/3.gif', myDescription: "Вы можете переключаться между тремя видами отображения: неделя, месяц и день. Это удобно, если у Вас множество кастомных событий — все под рукой :)" },
  { title: '', myTitle: 'Домашки', myImage: '/_defaults/guide/6.gif', myDescription: "В карточке домашнего задания мы постарались оставить только самое важное, а именно: дедлайн, дата публикации, название предмета и краткая по информация по самому заданию " },
  { title: '', myTitle: 'Статистика', myImage: '/_defaults/guide/5.gif', myDescription: "Для тех, кому интересно наблюдать за своей работой, мы подготовили несколько <span class='c-accent'>виджетов</span>, которые собирают статистику в реальном времени. Это дополнит картину Вашей успеваемости" },
  { title: '', myTitle: 'Достижения', myImage: '/_defaults/guide/4.gif', myDescription: "Наша команда понимает, что обучение — сложный процесс. Мы посчитали, что каждый студент заслуживает настоящей награды за свои успехи в учебе! Кроме того, это открывает доступ к новым <span class='c-accent'>аватаркам и цветам</span>, которые будут видны всем" },
  { title: '', myTitle: 'To do', myImage: '/_defaults/guide/7.gif', myDescription: "Вы можете менять статус выполнения домашек и кастомных задач, используя нашу <span class='c-accent'>todo-таблицу</span>. Для этого достаточно просто перетащить карточку в соответствующий столбец" },
  
];