
export interface GuideModalSchema {
  isModalOpen: boolean;
}

export const steps = [
  { title: '', myTitle: 'Виджет расписания', myImage: '/_defaults/guide/1.jpg', myDescription: 'В блоке справа вы можете увидеть виджет с расписанием — там находятся ваши пары. Пара которая идет сейчас подсвечена синим цветом. Дистанционные пары обозначены оранжевым цветом.' },
  { title: '', myTitle: 'Открытая страница расписания', myImage: '/_defaults/guide/2.jpg', myDescription: 'Вы можете переключаться между тремя видами отображения: неделя, месяц и день. Это удобно, если у Вас множество кастомных событий — все под рукой :)' },
  { title: '', myTitle: 'Достижения', myImage: '/_defaults/guide/3.jpg', myDescription: 'Наша команда понимаем, что обучение — сложный процесс. Мы посчитали, что каждый студент заслуживает настоящей награды за свои успехи в учебе! Кроме того, это открывает доступ к новым аватаркам и цветам, которые будут видны всем' },
  { title: '', myTitle: 'Статистика', myImage: '/_defaults/guide/4.jpg', myDescription: 'Для тех, кому интересно наблюдать за своей работой, мы подготовили несколько виджетов, которые собирают статистику в реальном времени. Это дополнит картину Вашей успеваемости' },
  { title: '', myTitle: 'Домашки', myImage: '/_defaults/guide/5.jpg', myDescription: 'В карточке домашнего задания мы постарались оставить только самое важное, а именно: дедлайн, дата публикации, название предмета и краткая по информация по самому заданию ' },
  { title: '', myTitle: 'To do', myImage: '/_defaults/guide/6.jpg', myDescription: 'Вы можете менять статус выполнения домашек и кастомных задач, используя нашу todo-таблицу. Для этого достаточно просто перетащить карточку в соответствующий столбец' },
  
];